// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

//Task1
{
    let random=[
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)],
        [Math.floor(Math.random() * 100)]
    ];
    let result=(random[0]+random[1]+random[2]+random[3]+random[4]+random[5]+random[6]+random[7]+random[8]+random[9]);
    console.log(result);
}

//Task2
{
    let book = {назва:'',кількістьсторінок:'',жанр:'' };
    console.log(book);
}
//Task3
{
    let book ={назва:'',кількістьсторінок:'',жанр:'',автори:'' };
    console.log(book);
}

//Task4
{
    let book=[
        {назва:'',кількістьсторінок:'',жанр:'',автори:'' },
        {назва:'',кількістьсторінок:'',жанр:'',автори:'' },
        {назва:'',кількістьсторінок:'',жанр:'',автори:'' },
        {назва:'',кількістьсторінок:'',жанр:'',автори:'' },
        {назва:'',кількістьсторінок:'',жанр:'',автори:'' }
    ]
    console.log(book);
}

//Task5
{
    let height=23;
    let width = 10;
    let s = 23*10;
    console.log(s);
}
//Task6
{
    let heightC = 10;
    let dC=4;
    let PI=3.14;
    let v = (heightC*PI*Math.pow(dC/2,2));
    console.log(v)
}

//Task7
{
    let n =3;
    let m = 4;
    let k =Math.pow((3**2+4**2),1/2);
    console.log(k);
}
